Documents/КорректировкаДолга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>КорректировкаДолга</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЗаказам</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентамиВВалюте</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентамиПоЗаказам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УвеличениеДолга</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРасчета</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УменьшениеДолга</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРасчета</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УвеличениеДолгаПоставщиков</Name>
					<Comment>Таблица выделена для целей обмена с БП</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРасчета</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УменьшениеДолгаПоставщиков</Name>
					<Comment>Таблица выделена для целей обмена с БП</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРасчета</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентами</Name>
			<Comment>Взаиморасчеты с контрагентами</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УДАЛИТЬ_Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПродукции</v8:Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТовараПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаБанковскойКартой</v8:Type>
						<v8:Type>cfg:DocumentRef.Замена</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТовараОтПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыСКонтрагентамиВВалюте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентамиВВалюте</Name>
			<Comment>Взаиморасчеты с контрагентами в валюте</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/РасчетыПоЗаказам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыПоЗаказам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/КорректировкаДолга/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработкаСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();

	// регистр ВзаиморасчетыСКонтрагентами Приход //Взаиморасчеты с контрагентами в валюте
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Записывать = Истина;
	
	ТабличныеЧастиУменьшение = Новый Массив;
	ТабличныеЧастиУменьшение.Добавить("УменьшениеДолга");
	ТабличныеЧастиУменьшение.Добавить("УменьшениеДолгаПоставщиков");

	ТабличныеЧастиУвеличение = Новый Массив;
	ТабличныеЧастиУвеличение.Добавить("УвеличениеДолга");
	ТабличныеЧастиУвеличение.Добавить("УвеличениеДолгаПоставщиков");

	Для каждого ИмяТЧ из ТабличныеЧастиУвеличение Цикл
		Для Каждого ТекСтрокаУвеличениеДолга Из ЭтотОбъект[ИмяТЧ] Цикл
			Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Контрагент = ТекСтрокаУвеличениеДолга.Контрагент;
			Движение.Договор = ТекСтрокаУвеличениеДолга.Договор;
			//Движение.Документ = Ссылка;
			Движение.Сумма = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ТекСтрокаУвеличениеДолга.Валюта, ВалютаУчета, Ссылка.Дата, ТекСтрокаУвеличениеДолга.Сумма);
			
			Движение = Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Контрагент = ТекСтрокаУвеличениеДолга.Контрагент;
			Движение.Договор = ТекСтрокаУвеличениеДолга.Договор;
			Движение.Валюта = ТекСтрокаУвеличениеДолга.Валюта;
			Движение.Сумма = ТекСтрокаУвеличениеДолга.Сумма;
		КонецЦикла;
	КонецЦикла;

	// регистр ВзаиморасчетыСКонтрагентами Расход //Взаиморасчеты с контрагентами в валюте
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	Для каждого ИмяТЧ из ТабличныеЧастиУменьшение Цикл
		Для Каждого ТекСтрокаУменьшениеДолга Из ЭтотОбъект[ИмяТЧ] Цикл
			Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Контрагент = ТекСтрокаУменьшениеДолга.Контрагент;
			Движение.Договор = ТекСтрокаУменьшениеДолга.Договор;
			//Движение.Документ = Ссылка;
			Движение.Сумма = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ТекСтрокаУменьшениеДолга.Валюта, ВалютаУчета, Ссылка.Дата, ТекСтрокаУменьшениеДолга.Сумма);
			
			Движение = Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Добавить();
			Движение.ВидДвижения =ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Контрагент = ТекСтрокаУменьшениеДолга.Контрагент;
			Движение.Договор = ТекСтрокаУменьшениеДолга.Договор;
			Движение.Валюта = ТекСтрокаУменьшениеДолга.Валюта;
			Движение.Сумма = ТекСтрокаУменьшениеДолга.Сумма;
		КонецЦикла;
	КонецЦикла;

	// #14354
	//РасчетыПоЗаказам 
	// расчеты с покупателем 
	СписокВидовДокументовПоКоторымВедутсяРасчеты = ОбщийМодуль.ПолучитьМассивТиповДокументовПоКоторымВедутсяРасчетыПоЗаказам();
	Движения.РасчетыПоЗаказам.Записывать = Истина;
	Для каждого ИмяТЧ из ТабличныеЧастиУвеличение Цикл
		Для Каждого ТекущаяСтрока Из ЭтотОбъект[ИмяТЧ] Цикл
			Если ТекущаяСтрока.Сумма = 0 ИЛИ НЕ ЗначениеЗаполнено(ТекущаяСтрока.ДокументРасчета) Тогда
				Продолжить;
			КонецЕсли;
			НайденныйВидДокумента = СписокВидовДокументовПоКоторымВедутсяРасчеты.Найти(ТипЗнч(ТекущаяСтрока.ДокументРасчета));
			Если НайденныйВидДокумента = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Движение = Движения.РасчетыПоЗаказам.Добавить();
			Движение.Период = Дата;
			Движение.Заказ = ТекущаяСтрока.ДокументРасчета;
			Движение.Контрагент = ТекущаяСтрока.ДокументРасчета.Контрагент; 
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход; //!
			Движение.Сумма = ТекущаяСтрока.Сумма;		
		КонецЦикла;
	КонецЦикла;
	
	Для каждого ИмяТЧ из ТабличныеЧастиУменьшение Цикл
		Для Каждого ТекущаяСтрока Из ЭтотОбъект[ИмяТЧ] Цикл
			Если ТекущаяСтрока.Сумма = 0 ИЛИ НЕ ЗначениеЗаполнено(ТекущаяСтрока.ДокументРасчета) Тогда
				Продолжить;
			КонецЕсли;
			НайденныйВидДокумента = СписокВидовДокументовПоКоторымВедутсяРасчеты.Найти(ТипЗнч(ТекущаяСтрока.ДокументРасчета));
			Если НайденныйВидДокумента = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Движение = Движения.РасчетыПоЗаказам.Добавить();
			Движение.Период = Дата;
			Движение.Заказ = ТекущаяСтрока.ДокументРасчета;
			Движение.Контрагент = ТекущаяСтрока.ДокументРасчета.Контрагент; 
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход; //!
			Движение.Сумма = ТекущаяСтрока.Сумма;		
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
